// function checkAge(age) {
//     if (age > 18) {
//       return true;
//     } else {
//       // ...
//       return confirm('Родители разрешили?');
//     }
//   }

//   function checkAge(age) {
//     if (age > 18) {
//       return true;
//     }
//     // ...
//     return confirm('Родители разрешили?');
//   }

//обе функии работают одинаково

// --------------------------------------------------------------------------------------------------------------------------------

// function checkAge(age) {
//     (age > 18) ? true : confirm('Родители разрешили?');
// }

// function checkAge(age) {
//    return age > 18 || confirm('Родители разрешили?');
// }

// --------------------------------------------------------------------------------------------------------------------------------
// function min(a,b){
//     return (a<=b) ? a : b
// }

// --------------------------------------------------------------------------------------------------------------------------------

let x = prompt("x", 0);
let n = prompt("n", 0);

function pow(x, n) {
  if (n < 1) alert("Введите натуральное число");
  else {
    let result = x;
    for (let i = 1; i < n; i++) {
      result = result * x;
    }
  }
  return result;
}

alert(pow(x, n));
