// let x = +prompt("x", 0);
// let y= +prompt("y", 0);
// alert(x+y)

//-----------------------------------------------------------------------------------------------------

function readNumber() {
  let number;

  do {
    number = prompt("введите число", 0);
  } while ( !isFinite(number) );

  if (number === null || number === '') return null;

  return number;
}

alert(readNumber());

//-----------------------------------------------------------------------------------------------------

let i = 0;
while (i != 10) {
  i += 0.2;
}

// из-за потери точности мы не дойдем до 10, поэтому всегда будет true => цикл бесконечный

